<?php

use Illuminate\Database\Seeder;

class MakeNewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $announces_titles = ['Інформаційна сесія «Як бізнесу скористатися можливостями програми COSME та HORIZON 2020»',
            'Семінар «Академічне письмо як інструмент доброчесності»',
            'Відкрита лекція «Данте: сучасність “Раю”»',
            'Стипендії Уряду Словацької Республіки',
            'Конкурсний відбір науково-технічних (експериментальних) розробок за державним замовленням',
            'Лекції з віктимології Крістофера Френча та Валерії Олех (США)',
            'Конкурс на отримання грантів від Міжнародних антарктичних організацій» ',
            '«Міжнародна парламентська стипендія» від Німецького уряду',
            'Курси німецької мови: триває набір ',
            'Стипендії Уряду Словацької Республіки',
            'Урочисте засідання Вченої ради університету'];

        $announces_periods = [
            'до 30 листопада 2017 року',
            'липень–жовтень 2017 року',
            'липень 2017 року',
            'до 30 червня 2017 року',
            'до 31 травня 2017 року',
            'до 30 травня 2017 року',
            '24 травня 2017 року',
            '18 травня 2017 року',
            '15 травня 2017 року',
            'до 15 травня 2017 року',
            '15–16 травня 2017 року'
        ];

        for ($i = 0; $i < 11; $i ++) {
            $image_name = "image".($i+1).".jpg";

            $sourcePath = public_path('dummy_images');
            //            $file = Input::file($sourcePath.'/'.$image_name);
//            $img = Image::make($file->getRealPath());
            $img = Image::make($sourcePath.'/'.$image_name);
            $destinationPath = public_path('images/news');

            $new_image_name = substr(md5($announces_titles[$i].time()).$img, 0, 5).'_'.$image_name;

            $img->save($destinationPath.'/'.$new_image_name);

            $destinationPath = public_path('thumbnail/news');
            $img->resize(150, 100, function ($constraint) {
                $constraint->aspectRatio();
            })->save($destinationPath.'/'.$new_image_name);

            DB::table('news')->insert([
                'title' => $announces_titles[$i],
                'type' => 1,
                'category_id' => rand(1,6),
                'period' => $announces_periods[$i],
                'text' => "9 травня відзначається День перемоги над нацизмом у Другій світовій війні, святкування якого традиційно проходить з меморіальними та урочистими акціями пам’яті й примирення, покладанням квітів до пам’ятників і могил солдатів, вшануванням ветеранів. Офіційним символом свята є квітка маку, автором якого став харківський дизайнер Сергій Мішакін.
Важливо поважати подвиг ветеранів війни, учасників українського визвольного руху та жертв нацизму, які відважно боролись і здобули перемогу над нацизмом у Другій світовій війні 1939–1945 років.
Харків став одним з європейських міст, що найбільше постраждали в роки Другої світової війни. Загальні збитки, нанесені «першій столиці», обчислювалися десятками мільярдів карбованців. Значних втрат зазнав і Харківський університет: його будівлі були пошкоджені, музейні колекції та бібліотека розграбовані, чимало цінних видань та експонатів вивезені до Німеччини. Професори, працівники й вихованці університету помирали від голоду та злиднів, гинули на фронтах, віддавали свої життя як учасники Руху Опору. Представники університетської спільноти протягом війни виявляли неабияку мужність та героїзм, за що були удостоєні високих державних нагород.
Каразінський пам’ятає безсмертний подвиг студбатівців у роки війни. У музеях університету зберігаються численні експонати й фотографії, копії документів, особисті речі, листи з фронту рідним та близьким, статті в газетах. Поруч із головним корпусом університету знаходиться пам’ятник студбатівцям, які не були професійними військовими, проте боролись на рівні з усіма, віддаючи усі сили й вміння за свободу свого народу. Більшість зі студентського батальйону загинули вже в перші місяці війни, однак вони дали відсіч німецько-фашистським загарбникам й подарували майбутнім поколінням можливість нових звершень.
Героїчні й трагічні епізоди Другої світової війни були закарбовані для нащадків у кадрах військової кінохроніки, зокрема в документальному фільмі «Битва за нашу Радянську Україну» (1943 року), що був створений під художнім керівництвом видатного українського режисера Олександра Довженка й з успіхом демонструвався в Радянському Союзі, США, Швеції, Франції, Фінляндії та інших країнах світу. За посиланням можна побачити, як виглядали Харків та університет після визволення у серпні 1943 року й почути розповіді свідків війни.",
                'is_top' => (rand(1,11)%5 == 0),
                'image_name' => $new_image_name
            ]);
        }


        $news_titles = ['День перемоги: університет пам’ятає',
            'День пам’яті та примирення: університет відзначає',
            'Міжнародний день астрономії: університет відзначає',
            'Співчуття з приводу передчасної смерті Юрія Холіна',
            'Всеукраїнські олімпіади університету: результати очного туру з біології',
            'Участь Каразінського у проекті британських рад ',
            'Студенти університету — переможці Всеукраїнського конкурсу молодих вчених та енергетиків',
            '«Семінар на природі або прагматична подорож-пригода»: захід для студентів факультету іноземних мов',
            'Відбулася акція «Діти війни (1941–1945): долі та спогади»',
            'Всеукраїнський юніорський турнір юних фізиків: вітаємо переможців ',
            'Студент університету Євгеній Афанасьєв отримав премію Національної академії наук України '];

        $news_periods = [
            '9 травня 2017 року',
            '8 травня 2017 року',
            '6 травня 2017 року',
            '5 травня 2017 року',
            '5 травня 2017 року',
            '5 травня 2017 року',
            '5 травня 2017 року',
            '5 травня 2017 року',
            '4 травня 2017 року',
            '3 травня 2017 року',
            '3 травня 2017 року',
        ];

        for ($i = 0; $i < 11; $i ++) {
            $image_name = "news".($i+1).".jpg";

            $sourcePath = public_path('dummy_images');
//            $file = Input::file($sourcePath.'/'.$image_name);
//            $img = Image::make($file->getRealPath());
            $img = Image::make($sourcePath.'/'.$image_name);

            $destinationPath = public_path('images/news');
            $new_image_name = substr(md5($announces_titles[$i].time()).$img, 0, 5).'_'.$image_name;

            $img->save($destinationPath.'/'.$new_image_name);

            $destinationPath = public_path('thumbnail/news');
            $img->resize(150, 100, function ($constraint) {
                $constraint->aspectRatio();
            })->save($destinationPath.'/'.$new_image_name);


            DB::table('news')->insert([
                'title' => $news_titles[$i],
                'type' => 2,
                'category_id' => rand(1,6),
                'period' => $news_periods[$i],
                'text' => "9 травня відзначається День перемоги над нацизмом у Другій світовій війні, святкування якого традиційно проходить з меморіальними та урочистими акціями пам’яті й примирення, покладанням квітів до пам’ятників і могил солдатів, вшануванням ветеранів. Офіційним символом свята є квітка маку, автором якого став харківський дизайнер Сергій Мішакін.
Важливо поважати подвиг ветеранів війни, учасників українського визвольного руху та жертв нацизму, які відважно боролись і здобули перемогу над нацизмом у Другій світовій війні 1939–1945 років.
Харків став одним з європейських міст, що найбільше постраждали в роки Другої світової війни. Загальні збитки, нанесені «першій столиці», обчислювалися десятками мільярдів карбованців. Значних втрат зазнав і Харківський університет: його будівлі були пошкоджені, музейні колекції та бібліотека розграбовані, чимало цінних видань та експонатів вивезені до Німеччини. Професори, працівники й вихованці університету помирали від голоду та злиднів, гинули на фронтах, віддавали свої життя як учасники Руху Опору. Представники університетської спільноти протягом війни виявляли неабияку мужність та героїзм, за що були удостоєні високих державних нагород.
Каразінський пам’ятає безсмертний подвиг студбатівців у роки війни. У музеях університету зберігаються численні експонати й фотографії, копії документів, особисті речі, листи з фронту рідним та близьким, статті в газетах. Поруч із головним корпусом університету знаходиться пам’ятник студбатівцям, які не були професійними військовими, проте боролись на рівні з усіма, віддаючи усі сили й вміння за свободу свого народу. Більшість зі студентського батальйону загинули вже в перші місяці війни, однак вони дали відсіч німецько-фашистським загарбникам й подарували майбутнім поколінням можливість нових звершень.
Героїчні й трагічні епізоди Другої світової війни були закарбовані для нащадків у кадрах військової кінохроніки, зокрема в документальному фільмі «Битва за нашу Радянську Україну» (1943 року), що був створений під художнім керівництвом видатного українського режисера Олександра Довженка й з успіхом демонструвався в Радянському Союзі, США, Швеції, Франції, Фінляндії та інших країнах світу. За посиланням можна побачити, як виглядали Харків та університет після визволення у серпні 1943 року й почути розповіді свідків війни.",
                'is_top' => (rand(1,11)%5 == 0),
                'image_name' => $new_image_name
            ]);
        }
    }
}
